

# for문을 사용하여 다음과 같이 숫자를 출력해 보자
# '''
# 1 2 3 4 5
# 6 7 8 9 10
# 11 12 13 14 15
# 16 17 18 19 20
# 21 22 23 24 25
# '''
# for i in range(1, 26):
#     print(f"{i:2}" , end="\t")
#     if i % 5 == 0:
#         print()

# for i in range(1, 22, 5): # [1, 6, 11, 16, 21]
#     for j in range(5):# [0,1,2,3,4]
#         print(f'{i + j:2}', end="\t")
#     print("\b")







numbers = [45, 23, 67, 12, 89, 34, 56]
# numbers가 있을 때 최대값과 최소값의 차이를 출력하세요
# 프로그램을 실행했을 때 요소가 달라져도 차이값이 계산되어야한다.
# [출력결과]
# 최대값 최소값의 차이는 77입니다.
# max = numbers[0]
# min = numbers[0]
# for i in numbers:
#     if max < i:
#         max = i
#     if min > i:
#         min = i
# print(f'최대값 최소값의 차이는 {max - min}입니다.')





# 구구단 전체를 출력해보자
# ====2단====	====3단====	====4단====	====5단====	====6단====	====7단====	====8단====	====9단====
# 2 * 1 =  2	3 * 1 =  3	4 * 1 =  4	5 * 1 =  5	6 * 1 =  6	7 * 1 =  7	8 * 1 =  8	9 * 1 =  9
# 2 * 2 =  4	3 * 2 =  6	4 * 2 =  8	5 * 2 = 10	6 * 2 = 12	7 * 2 = 14	8 * 2 = 16	9 * 2 = 18
# 2 * 3 =  6	3 * 3 =  9	4 * 3 = 12	5 * 3 = 15	6 * 3 = 18	7 * 3 = 21	8 * 3 = 24	9 * 3 = 27
# 2 * 4 =  8	3 * 4 = 12	4 * 4 = 16	5 * 4 = 20	6 * 4 = 24	7 * 4 = 28	8 * 4 = 32	9 * 4 = 36
# 2 * 5 = 10	3 * 5 = 15	4 * 5 = 20	5 * 5 = 25	6 * 5 = 30	7 * 5 = 35	8 * 5 = 40	9 * 5 = 45
# 2 * 6 = 12	3 * 6 = 18	4 * 6 = 24	5 * 6 = 30	6 * 6 = 36	7 * 6 = 42	8 * 6 = 48	9 * 6 = 54
# 2 * 7 = 14	3 * 7 = 21	4 * 7 = 28	5 * 7 = 35	6 * 7 = 42	7 * 7 = 49	8 * 7 = 56	9 * 7 = 63
# 2 * 8 = 16	3 * 8 = 24	4 * 8 = 32	5 * 8 = 40	6 * 8 = 48	7 * 8 = 56	8 * 8 = 64	9 * 8 = 72
# 2 * 9 = 18	3 * 9 = 27	4 * 9 = 36	5 * 9 = 45	6 * 9 = 54	7 * 9 = 63	8 * 9 = 72	9 * 9 = 81

#  아랫줄로 내려오면 윗줄로는 돌아갈 수 없다.
for dan in range(2, 10):
    # print(f'===={dan}단====', end="\t")
    print(f'{str(dan) + '단':=^10}', end="\t")
print()

for num in range(1, 10):
    for dan in range(2, 10):
        print(f'{dan} * {num} = {dan * num:2}',end="\t")
    print()






























































































