

# 상속
# 기존에 존재하던 클래스가 가지고 있는 모든 데이터를 받아서 사용하는 것

# 부모 클래스 (super class)
# 자식 클래스 (sub class)

# 상속은 두 클래스가 Is - A 관계를 이루었을 때 사용한다.
# ex) Student is a Person 처럼 일반화가 가능한 관계

# 상속 구현
# 자식클래스에서 클래스명 옆에 ()를 작성해서 어떤 클래스에서 상속받는지 명시하면 상속기능을 지원한다.

# super()
# 자신의 부모 클래스를 대신하는 대명사처럼 사용된다.
# 이 super()를 이용해서 부모 클래스가 가지고있는 메서드 또는 변수 등을 사용할 수 있다.

# 파이썬에서는 다중상속을 지원한다.
# 여러 개의 부모 클래스에서 똑같은 이름의 데이터를 가지고 있다면 상속을 명시한 부모 클래스의 순서대로 시스템이 접근하여 데이터를 가져온다.

# 메서드 오버라이딩
# 부모 클래스가 가지고 있던 메서드를 자식 클래스에서 재정의 하는 것
# 부모 클래스가 가지고 있던 메서드와 메서드 명이 같다면 오버라이딩으로 취급한다!


# 다형성
# 한 개의 객체가 여러 종류의 클래스(자료형)의 인스턴스가 될 수 있다.
#

# 자식 클래스의 인스턴스는 부모 클래스의 인스턴스도 될 수 있다!!

# isinstance() 함수

# print(isinstance(객체, 클래스))












































































































































