

# 추상 클래스

# 추상 클래스?
# 추상 메서드를 하나 이상 가지고 있는 클래스

# 추상 메서드?
# 메서드는 선언되어있지만 구현부가 구현되어있지않는 메서드
# 선언부   : def 함수이름(매개변수)
# 구현부   : 함수의 코드블럭 부분

# ---------------------------------------------

# 특징
# 1. 기본적으로 상속을 위해서 생성된 클래스

# 2. 추상 클래스는 인스턴스를 생성할 수 없다

# 3. 추상 클래스를 상속받은 자식(일반) 클래스는 추상 메서드를 구현하도록 시스템적으로 강제받는다!!
# ---> 장점
# 특정 메서드의 구현을 자식 클래스에서 강제해서 설계 오류 등을 방지할 수 있다.














































































