

# 추상 클래스 (abstract class)
# 추상 메서드를 하나 이상 가지고 있는 클래스

# 추상 메서드
# 메서드의 선언부만 존재하고 구현부가 없는 메서드

# 추상 클래스 특징
# 1. 클래스의 인스턴스를 직접 생성할 수 없다.
# 2. 이 클래스를 상속받은 자식 클래스는 추상 메서드를 구현해야한다.



# 재귀 함수
# 문제를 해결하기 위해 자기자신을 호출하면서 더 작은 문제로 나누어서 해결하는 함수
# ---> 반복문의 효과를 가진 함수

# 장점
# 변수를 여러 개 사용하지않는다.
# 코드가 간결하다

# 단점
# 함수가 실행되는 동안에는 더 많은 메모리를 사용한다.
# 보통 일반 반복문을 사용하는 것이 성능이 좋다


# 기본 형태
# def func(입력값):
#   if 조건식:
#       return 데이터
#   else:
#       return func(입려값 - 1)


















































































































































